
## Plan Result (terraform/aws/openclaw)

[CI link](https://github.com/boxp/arch/actions/runs/21955748604)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_ssm_parameter.xai_api_key


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ssm_parameter.xai_api_key will be created
  + resource "aws_ssm_parameter" "xai_api_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "xAI API Key for OpenClaw"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/lolice/openclaw/XAI_API_KEY"
      + region         = "ap-northeast-1"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":6813,"Program":"tfcmt","SHA1":"a5c94bcd7f859891a3b9231925bc95f8cba82796","Target":"terraform/aws/openclaw","Vars":{},"WorkflowName":"pull_request_target"} -->